; domain
;; Adapted from: https://github.com/josej30/Planner-Sat-Constraints
;; We use existential preconditions (exists) to remove as many parameters from the actions as possible

(define (domain logistics)

(:requirements :strips :typing :existential-preconditions) 

(:types  city location thing - object
         package vehicle - thing
         truck airplane - vehicle  
         airport - location)
  
(:predicates  (in-city ?l - location ?c - city)
              (at ?obj - thing ?l - location)
              (in ?p - package ?veh - vehicle))
  
(:action drive
         :parameters    (?t - truck ?from ?to - location)
         :precondition  (and 
                             (at ?t ?from)
                             (exists (?c - city)
                                (and (in-city ?from ?c) (in-city ?to ?c))
                              )
                         )
         :effect        (and (not (at ?t ?from))
                             (at ?t ?to)))

(:action fly
         :parameters    (?a - airplane ?from ?to - airport)
         :precondition  (at ?a ?from)
         :effect        (and (not (at ?a ?from))
                             (at ?a ?to)))

(:action load
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (at ?p ?l))
         :effect        (and (not (at ?p ?l))
                             (in ?p ?v)))

(:action unload
         :parameters    (?v - vehicle ?p - package ?l - location)
         :precondition  (and (at ?v ?l)
                             (in ?p ?v))
         :effect        (and (not (in ?p ?v))
                             (at ?p ?l)))

)

; problem
(define (problem problem_logistics_1)

(:domain logistics)

(:objects
	obj0 obj7 obj8 - airport
	obj1 obj9 - city
	obj2 obj3 obj5 obj12 obj14 obj15 - package
	obj4 obj11 obj13 obj16 - truck
	obj6 - airplane
	obj10 - location
)

(:init
	(at obj16 obj7)
	(in-city obj0 obj1)
	(at obj4 obj0)
	(at obj5 obj0)
	(at obj6 obj0)
	(in-city obj10 obj9)
	(at obj14 obj8)
	(at obj13 obj8)
	(at obj15 obj7)
	(in-city obj7 obj1)
	(in-city obj8 obj9)
	(at obj2 obj0)
	(at obj3 obj0)
	(at obj11 obj10)
	(at obj12 obj8)
)

(:goal (and
	(at obj5 obj7)
	(at obj14 obj10)
	(at obj2 obj7)
	(at obj3 obj7)
	(at obj15 obj0)
	(at obj12 obj7)
))
)

; plan
1. (fly obj6 obj0 obj8)
   deleted: (at obj6 obj0)
   added: (at obj6 obj8)
   goals met: 0 of 6
2. (load obj6 obj12 obj8)
   deleted: (at obj12 obj8)
   added: (in obj12 obj6)
   goals met: 0 of 6
3. (fly obj6 obj8 obj7)
   deleted: (at obj6 obj8)
   added: (at obj6 obj7)
   goals met: 0 of 6
4. (load obj6 obj15 obj7)
   deleted: (at obj15 obj7)
   added: (in obj15 obj6)
   goals met: 0 of 6
5. (fly obj6 obj7 obj0)
   deleted: (at obj6 obj7)
   added: (at obj6 obj0)
   goals met: 0 of 6
6. (load obj6 obj5 obj0)
   deleted: (at obj5 obj0)
   added: (in obj5 obj6)
   goals met: 0 of 6
7. (load obj6 obj3 obj0)
   deleted: (at obj3 obj0)
   added: (in obj3 obj6)
   goals met: 0 of 6
8. (load obj6 obj2 obj0)
   deleted: (at obj2 obj0)
   added: (in obj2 obj6)
   goals met: 0 of 6
9. (unload obj6 obj15 obj0)
   deleted: (in obj15 obj6)
   added: (at obj15 obj0)
   goals met: 1 of 6
10. (fly obj6 obj0 obj7)
   deleted: (at obj6 obj0)
   added: (at obj6 obj7)
   goals met: 1 of 6
11. (unload obj6 obj5 obj7)
   deleted: (in obj5 obj6)
   added: (at obj5 obj7)
   goals met: 2 of 6
12. (unload obj6 obj3 obj7)
   deleted: (in obj3 obj6)
   added: (at obj3 obj7)
   goals met: 3 of 6
13. (unload obj6 obj2 obj7)
   deleted: (in obj2 obj6)
   added: (at obj2 obj7)
   goals met: 4 of 6
14. (unload obj6 obj12 obj7)
   deleted: (in obj12 obj6)
   added: (at obj12 obj7)
   goals met: 5 of 6
15. (load obj13 obj14 obj8)
   deleted: (at obj14 obj8)
   added: (in obj14 obj13)
   goals met: 5 of 6
16. (drive obj13 obj8 obj10)
   deleted: (at obj13 obj8)
   added: (at obj13 obj10)
   goals met: 5 of 6
17. (unload obj13 obj14 obj10)
   deleted: (in obj14 obj13)
   added: (at obj14 obj10)
   goals met: 6 of 6
